-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/gisellelab/pCloud Drive/PHD/Courses/02 - Second Year/ECON 717 (Metrics)/Problem Sets/Problem Set 3/log_ps3.log
  log type:  text
 opened on:  28 Mar 2022, 09:01:08

. 
. 
. /*
>         Problem set 3, Econ 717
>         
>         Date created:  19 Mar 2022
>         
>         Last modified: 27 Mar 2022
>         
>         Author: Giselle Labrador-Badia (labradorbada@wisc.edu)
> */
. 
. 
. /* Setup */
. 
. 
. // establish working directory
. cd "/Users/gisellelab/pCloud Drive/PHD/Courses/02 - Second Year/ECON 717 (Metrics)/Problem Sets/Problem Set 3"
/Users/gisellelab/pCloud Drive/PHD/Courses/02 - Second Year/ECON 717 (Metrics)/Problem Sets/Problem Set 3

. 
. 
. // Loading data
. use "Economics 717 Miron and Tetelbaum Data.dta", clear

. 
. // save outreg 
. glob opts "tex(frag) nor noobs noas"

. 
. 
. /* question 1 */
. /*
> Tell Stata that this is panel data using the command xtset state year
> */
. 
. xtset state year

Panel variable: state (strongly balanced)
 Time variable: year, 1975 to 2005
         Delta: 1 unit

. 
. /* question 2 */
. /*
> Create a binary treatment indicator called "mlda21" that equals one for state-years 
> in which the MLDA equals 21 and zero for all other state-years.
> */
. 
. gen mlda_21 = (mlda == 21)

. 
. /* question 3 */
. /*
> Ignore the panel nature of the data and obtain a naïve estimate of the treatment effect.
> */
. 
. reg rate18_20ht mlda_21, robust

Linear regression                               Number of obs     =        651
                                                F(1, 649)         =       2.54
                                                Prob > F          =     0.1111
                                                R-squared         =     0.0044
                                                Root MSE          =     16.802

------------------------------------------------------------------------------
             |               Robust
 rate18_20ht | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mlda_21 |  -3.150429   1.974831    -1.60   0.111     -7.02826    .7274009
       _cons |   45.32411   1.845321    24.56   0.000     41.70059    48.94763
------------------------------------------------------------------------------

. outreg2 using tableq3_q4.tex, replace `opts' addtext(year FE, -, state FE, -, cluster,- ) keep(mlda_21)
tableq3_q4.tex
dir : seeout

. 
. /* question 4 */
. /*
> Obtain two other naïve treatment effect estimates by repeating the exercise in the preceding problem.
> */
. 
. //adding only state fixed effects
. reg rate18_20ht mlda_21 i.state, robust

Linear regression                               Number of obs     =        651
                                                F(21, 629)        =      38.72
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5003
                                                Root MSE          =     12.091

------------------------------------------------------------------------------
             |               Robust
 rate18_20ht | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mlda_21 |  -9.293325   1.322639    -7.03   0.000    -11.89065   -6.696002
             |
       state |
          5  |  -17.63309   2.279453    -7.74   0.000    -22.10934   -13.15683
          6  |  -18.00307   1.721575   -10.46   0.000     -21.3838   -14.62234
          9  |  -41.94561   2.520803   -16.64   0.000    -46.89581    -36.9954
         12  |  -28.88859   2.290481   -12.61   0.000     -33.3865   -24.39067
         15  |  -14.43497   1.847908    -7.81   0.000    -18.06379   -10.80616
         17  |  -10.34093   2.054942    -5.03   0.000    -14.37631   -6.305552
         18  |  -4.167683   1.565229    -2.66   0.008     -7.24139   -1.093976
         19  |  -11.45499   1.752748    -6.54   0.000    -14.89693   -8.013039
         21  |   -23.6835   1.704102   -13.90   0.000    -27.02991   -20.33708
         23  |  -19.97684   1.693737   -11.79   0.000     -23.3029   -16.65078
         25  |  -1.037205   2.268139    -0.46   0.648    -5.491246    3.416836
         26  |  -3.567835   1.782715    -2.00   0.046    -7.068628   -.0670416
         29  |   2.198612    4.57074     0.48   0.631    -6.777145    11.17437
         32  |   16.47085   4.081429     4.04   0.000     8.455978    24.48573
         35  |  -14.19745   3.218416    -4.41   0.000    -20.51759   -7.877306
         38  |  -8.028192   3.009831    -2.67   0.008    -13.93873   -2.117659
         39  |  -19.78079   1.763229   -11.22   0.000    -23.24332   -16.31826
         45  |  -17.64001   2.361935    -7.47   0.000    -22.27824   -13.00178
         46  |   -4.78062   3.383739    -1.41   0.158    -11.42541    1.864173
         48  |  -15.41629   2.662471    -5.79   0.000     -20.6447   -10.18788
             |
       _cons |   62.76629   1.833272    34.24   0.000     59.16622    66.36637
------------------------------------------------------------------------------

. outreg2 using tableq3_q4.tex, append `opts'  addtext(year FE,-  , state FE, X, cluster,- ) keep(mlda_21)
tableq3_q4.tex
dir : seeout

.                 
. // adding only year fixed effects. 
.                 
. reg rate18_20ht mlda_21 i.year, robust

Linear regression                               Number of obs     =        651
                                                F(31, 619)        =       6.06
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2382
                                                Root MSE          =     15.049

------------------------------------------------------------------------------
             |               Robust
 rate18_20ht | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mlda_21 |    8.88623   2.327919     3.82   0.000     4.314654    13.45781
             |
        year |
       1976  |   1.586774   5.516733     0.29   0.774    -9.247007    12.42055
       1977  |   4.471938   6.311562     0.71   0.479    -7.922732    16.86661
       1978  |   6.942881   6.015238     1.15   0.249    -4.869867    18.75563
       1979  |   5.010186   6.146383     0.82   0.415    -7.060104    17.08047
       1980  |   3.763819   5.903032     0.64   0.524    -7.828577    15.35621
       1981  |  -2.728805    5.13647    -0.53   0.595    -12.81582    7.358213
       1982  |  -1.368997   6.110785    -0.22   0.823    -13.36938    10.63139
       1983  |  -8.660304   5.374272    -1.61   0.108    -19.21432    1.893711
       1984  |  -6.014903   5.364249    -1.12   0.263    -16.54923    4.519429
       1985  |  -7.919455   5.167422    -1.53   0.126    -18.06726    2.228348
       1986  |  -4.639364   5.654572    -0.82   0.412    -15.74383    6.465106
       1987  |  -8.371328   5.591144    -1.50   0.135    -19.35124    2.608581
       1988  |  -7.789676    5.36555    -1.45   0.147    -18.32656     2.74721
       1989  |  -12.08243   5.110149    -2.36   0.018    -22.11776   -2.047103
       1990  |  -9.554697   5.476933    -1.74   0.082    -20.31032    1.200924
       1991  |  -13.09518   5.371553    -2.44   0.015    -23.64385   -2.546502
       1992  |  -20.74726   4.865527    -4.26   0.000     -30.3022   -11.19232
       1993  |  -19.22245   5.258629    -3.66   0.000    -29.54937   -8.895537
       1994  |  -15.53561   5.138342    -3.02   0.003    -25.62631   -5.444915
       1995  |  -14.22957   5.358827    -2.66   0.008    -24.75325   -3.705882
       1996  |  -17.84585   5.377473    -3.32   0.001    -28.40615    -7.28555
       1997  |  -18.86017   5.010438    -3.76   0.000    -28.69969   -9.020657
       1998  |  -18.59504   5.290838    -3.51   0.000     -28.9852   -8.204869
       1999  |  -20.99159   5.084979    -4.13   0.000    -30.97749   -11.00569
       2000  |  -20.19126    5.13024    -3.94   0.000    -30.26605   -10.11648
       2001  |    -21.785   5.050018    -4.31   0.000    -31.70224   -11.86775
       2002  |  -19.70543   5.440937    -3.62   0.000    -30.39036   -9.020494
       2003  |  -20.23837   4.871717    -4.15   0.000    -29.80547   -10.67128
       2004  |  -20.52885   5.666785    -3.62   0.000     -31.6573   -9.400393
       2005  |  -22.08502   5.420049    -4.07   0.000    -32.72894   -11.44111
             |
       _cons |   45.74022   4.539007    10.08   0.000      36.8265    54.65393
------------------------------------------------------------------------------

. outreg2 using tableq3_q4.tex, append `opts'  addtext(year FE, -, state FE, X, cluster, -) keep(mlda_21)
tableq3_q4.tex
dir : seeout

. 
. 
. /* question 5 */
. /*
> Obtain the standard estimate of the treatment effect by regressing the traffic fatality 
> rate on the treatment indicator and including both state and year fixed effect
> */
. 
. reg rate18_20ht mlda_21 i.state i.year, robust cl(state)

Linear regression                               Number of obs     =        651
                                                F(19, 20)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.6914
                                                Root MSE          =     9.7375

                                 (Std. err. adjusted for 21 clusters in state)
------------------------------------------------------------------------------
             |               Robust
 rate18_20ht | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mlda_21 |   5.755264   4.764454     1.21   0.241    -4.183213    15.69374
             |
       state |
          5  |  -17.63309   8.62e-14 -2.0e+14   0.000    -17.63309   -17.63309
          6  |  -11.69237   1.997997    -5.85   0.000    -15.86012   -7.524622
          9  |  -36.12035   1.844305   -19.58   0.000     -39.9675   -32.27319
         12  |  -23.06333   1.844305   -12.51   0.000    -26.91048   -19.21618
         15  |  -14.43497   8.66e-14 -1.7e+14   0.000    -14.43497   -14.43497
         17  |  -5.001109   1.690613    -2.96   0.008    -8.527665   -1.474552
         18  |  -4.167683   8.64e-14 -4.8e+13   0.000    -4.167683   -4.167683
         19  |  -5.629725   1.844305    -3.05   0.006    -9.476877   -1.782573
         21  |  -19.79999   1.229536   -16.10   0.000    -22.36476   -17.23522
         23  |  -18.03509   .6147682   -29.34   0.000    -19.31747    -16.7527
         25  |   4.788055   1.844305     2.60   0.017     .9409026    8.635207
         26  |  -3.567835   8.63e-14 -4.1e+13   0.000    -3.567835   -3.567835
         29  |   2.198612   8.65e-14  2.5e+13   0.000     2.198612    2.198612
         32  |   16.47085   8.63e-14  1.9e+14   0.000     16.47085    16.47085
         35  |  -14.19745   8.63e-14 -1.6e+14   0.000    -14.19745   -14.19745
         38  |  -8.028192   8.62e-14 -9.3e+13   0.000    -8.028192   -8.028192
         39  |  -19.78079   8.62e-14 -2.3e+14   0.000    -19.78079   -19.78079
         45  |  -17.64001   8.65e-14 -2.0e+14   0.000    -17.64001   -17.64001
         46  |    1.04464   1.844305     0.57   0.577    -2.802512    4.891792
         48  |  -15.41629   8.63e-14 -1.8e+14   0.000    -15.41629   -15.41629
             |
        year |
       1976  |   1.586774   2.074697     0.76   0.453    -2.740968    5.914516
       1977  |   4.471938   2.212946     2.02   0.057    -.1441867    9.088062
       1978  |   6.942881   2.423455     2.86   0.010     1.887642    11.99812
       1979  |   5.159279   2.291585     2.25   0.036     .3791171    9.939441
       1980  |   3.912912   2.523114     1.55   0.137    -1.350212    9.176037
       1981  |  -2.579711   3.524938    -0.73   0.473    -9.932604    4.773181
       1982  |  -1.219903   2.025216    -0.60   0.554     -5.44443    3.004623
       1983  |  -8.362117   2.877852    -2.91   0.009    -14.36521   -2.359023
       1984  |  -5.716716   3.685785    -1.55   0.137    -13.40513    1.971698
       1985  |  -7.621268   3.288115    -2.32   0.031    -14.48016   -.7623797
       1986  |  -4.192083   3.448021    -1.22   0.238    -11.38453    3.000363
       1987  |  -7.178579   3.857767    -1.86   0.078    -15.22574    .8685828
       1988  |  -6.447833   3.883399    -1.66   0.112    -14.54846    1.652795
       1989  |  -10.74059   3.983096    -2.70   0.014    -19.04918   -2.431999
       1990  |  -8.212854   3.135324    -2.62   0.016    -14.75302   -1.672683
       1991  |  -11.75333   3.834787    -3.06   0.006    -19.75256   -3.754109
       1992  |  -19.40542   4.517521    -4.30   0.000     -28.8288   -9.982033
       1993  |  -17.88061   4.811318    -3.72   0.001    -27.91684   -7.844378
       1994  |  -14.19377     4.9687    -2.86   0.010    -24.55829    -3.82924
       1995  |  -12.88772   4.097612    -3.15   0.005    -21.43519   -4.340255
       1996  |  -16.50401   4.355753    -3.79   0.001    -25.58995   -7.418067
       1997  |  -17.51833   4.417279    -3.97   0.001    -26.73261    -8.30405
       1998  |  -17.25319   4.725276    -3.65   0.002    -27.10995   -7.396441
       1999  |  -19.64975   4.916104    -4.00   0.001    -29.90456   -9.394934
       2000  |  -18.84942    4.81127    -3.92   0.001    -28.88555   -8.813287
       2001  |  -20.44315   5.869097    -3.48   0.002    -32.68587   -8.200431
       2002  |  -18.36358   4.861316    -3.78   0.001    -28.50411   -8.223058
       2003  |  -18.89653   4.613319    -4.10   0.001    -28.51975   -9.273316
       2004  |    -19.187   4.939236    -3.88   0.001    -29.49007   -8.883937
       2005  |  -20.74318   4.590038    -4.52   0.000    -30.31783   -11.16853
             |
       _cons |   57.51535   4.778858    12.04   0.000     47.54682    67.48387
------------------------------------------------------------------------------

. outreg2 using tableq3_q4.tex, append `opts'  addtext(year FE,X, state FE, X, cluster,X ) keep(mlda_21)
tableq3_q4.tex
dir : seeout

. 
. 
. /* question 6 */
. /*
> Repeat the exercise in the preceding problem but omitting the "cluster(state)" option.
> */
. 
. reg rate18_20ht mlda_21 i.state i.year, robust 

Linear regression                               Number of obs     =        651
                                                F(51, 599)        =      25.04
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6914
                                                Root MSE          =     9.7375

------------------------------------------------------------------------------
             |               Robust
 rate18_20ht | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mlda_21 |   5.755264   1.668881     3.45   0.001     2.477694    9.032833
             |
       state |
          5  |  -17.63309   1.666067   -10.58   0.000    -20.90513   -14.36104
          6  |  -11.69237   1.951735    -5.99   0.000    -15.52545   -7.859295
          9  |  -36.12035   2.996451   -12.05   0.000    -42.00517   -30.23552
         12  |  -23.06333   2.330228    -9.90   0.000    -27.63974   -18.48692
         15  |  -14.43497   1.720481    -8.39   0.000    -17.81388   -11.05607
         17  |  -5.001109   2.063429    -2.42   0.016    -9.053544   -.9486732
         18  |  -4.167683   2.078342    -2.01   0.045    -8.249405   -.0859611
         19  |  -5.629725   2.008666    -2.80   0.005    -9.574609   -1.684841
         21  |  -19.79999    1.81642   -10.90   0.000    -23.36732   -16.23266
         23  |  -18.03509   1.824432    -9.89   0.000    -21.61815   -14.45203
         25  |   4.788055   2.607444     1.84   0.067    -.3327885    9.908898
         26  |  -3.567835   2.239547    -1.59   0.112    -7.966154    .8304842
         29  |   2.198612   3.411899     0.64   0.520    -4.502126    8.899351
         32  |   16.47085   3.071123     5.36   0.000     10.43938    22.50233
         35  |  -14.19745   2.578666    -5.51   0.000    -19.26177    -9.13312
         38  |  -8.028192   2.209552    -3.63   0.000     -12.3676   -3.688781
         39  |  -19.78079   1.840723   -10.75   0.000    -23.39585   -16.16574
         45  |  -17.64001   2.003659    -8.80   0.000    -21.57506   -13.70496
         46  |    1.04464   3.280043     0.32   0.750    -5.397142    7.486423
         48  |  -15.41629   1.848006    -8.34   0.000    -19.04565   -11.78693
             |
        year |
       1976  |   1.586774   3.550686     0.45   0.655    -5.386533    8.560081
       1977  |   4.471938   4.322481     1.03   0.301    -4.017121      12.961
       1978  |   6.942881   3.678828     1.89   0.060    -.2820875    14.16785
       1979  |   5.159279   4.149023     1.24   0.214    -2.989121    13.30768
       1980  |   3.912912   3.888638     1.01   0.315    -3.724109    11.54993
       1981  |  -2.579711   3.497186    -0.74   0.461    -9.447947    4.288525
       1982  |  -1.219903   4.101644    -0.30   0.766    -9.275254    6.835448
       1983  |  -8.362117   3.350342    -2.50   0.013    -14.94196   -1.782271
       1984  |  -5.716716   3.585548    -1.59   0.111    -12.75849    1.325059
       1985  |  -7.621268   3.300416    -2.31   0.021    -14.10306   -1.139475
       1986  |  -4.192083   3.362003    -1.25   0.213    -10.79483    2.410663
       1987  |  -7.178579   3.462968    -2.07   0.039    -13.97961   -.3775437
       1988  |  -6.447833    3.46534    -1.86   0.063    -13.25353    .3578594
       1989  |  -10.74059   3.345871    -3.21   0.001    -17.31166   -4.169526
       1990  |  -8.212854   3.323583    -2.47   0.014    -14.74014   -1.685563
       1991  |  -11.75333     3.1375    -3.75   0.000    -17.91517   -5.591497
       1992  |  -19.40542   3.331777    -5.82   0.000     -25.9488   -12.86203
       1993  |  -17.88061   3.576713    -5.00   0.000    -24.90503   -10.85619
       1994  |  -14.19377   3.779159    -3.76   0.000    -21.61578   -6.771754
       1995  |  -12.88772   3.436375    -3.75   0.000    -19.63653   -6.138917
       1996  |  -16.50401   3.416089    -4.83   0.000    -23.21298   -9.795041
       1997  |  -17.51833   3.498008    -5.01   0.000    -24.38818   -10.64848
       1998  |  -17.25319   3.556255    -4.85   0.000    -24.23744   -10.26895
       1999  |  -19.64975   3.771412    -5.21   0.000    -27.05654   -12.24295
       2000  |  -18.84942   3.410245    -5.53   0.000    -25.54691   -12.15193
       2001  |  -20.44315   3.962487    -5.16   0.000    -28.22521    -12.6611
       2002  |  -18.36358    3.61721    -5.08   0.000    -25.46754   -11.25963
       2003  |  -18.89653   3.633407    -5.20   0.000     -26.0323   -11.76077
       2004  |    -19.187    3.71457    -5.17   0.000    -26.48217   -11.89184
       2005  |  -20.74318   3.556779    -5.83   0.000    -27.72845   -13.75791
             |
       _cons |   57.51535    3.51386    16.37   0.000     50.61436    64.41633
------------------------------------------------------------------------------

. outreg2 using tableq3_q4.tex, append `opts' addtext(year FE,X, state FE, X, cluster,-) keep(mlda_21)
tableq3_q4.tex
dir : seeout

. 
. 
. /* question 7 */
. /*
> Repeat Problem 6 but ut omitting years of data after 1990. 
> */
. 
. reg rate18_20ht mlda_21 i.state i.year ///
>     if year <= 1990, ///
>         robust cl(state)

Linear regression                               Number of obs     =        336
                                                F(15, 20)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.7694
                                                Root MSE          =     8.8637

                                 (Std. err. adjusted for 21 clusters in state)
------------------------------------------------------------------------------
             |               Robust
 rate18_20ht | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mlda_21 |   1.164507   2.989659     0.39   0.701    -5.071813    7.400826
             |
       state |
          5  |  -11.45413   5.05e-14 -2.3e+14   0.000    -11.45413   -11.45413
          6  |  -10.65691   2.429098    -4.39   0.000    -15.72392   -5.589897
          9  |  -44.13431   2.242244   -19.68   0.000    -48.81155   -39.45707
         12  |  -20.49993   2.242244    -9.14   0.000    -25.17717   -15.82269
         15  |  -12.36255   5.06e-14 -2.4e+14   0.000    -12.36255   -12.36255
         17  |  -2.703161   2.055391    -1.32   0.203    -6.990631    1.584308
         18  |  -5.478406   5.06e-14 -1.1e+14   0.000    -5.478406   -5.478406
         19  |  -5.158613   2.242244    -2.30   0.032    -9.835852   -.4813731
         21  |  -18.11521    1.49483   -12.12   0.000    -21.23337   -14.99705
         23  |  -15.61975   .7474148   -20.90   0.000    -17.17883   -14.06067
         25  |  -1.754381   2.242244    -0.78   0.443    -6.431621    2.922858
         26  |   -5.17912   5.06e-14 -1.0e+14   0.000     -5.17912    -5.17912
         29  |   17.42928   5.41e-14  3.2e+14   0.000     17.42928    17.42928
         32  |   29.07168   5.05e-14  5.8e+14   0.000     29.07168    29.07168
         35  |  -8.097558   5.06e-14 -1.6e+14   0.000    -8.097558   -8.097558
         38  |   .8843718   5.05e-14  1.8e+13   0.000     .8843718    .8843718
         39  |  -18.59664   5.08e-14 -3.7e+14   0.000    -18.59664   -18.59664
         45  |  -13.06255   5.06e-14 -2.6e+14   0.000    -13.06255   -13.06255
         46  |   9.841345   2.242244     4.39   0.000     5.164105    14.51858
         48  |  -7.806229   5.05e-14 -1.5e+14   0.000    -7.806229   -7.806229
             |
        year |
       1976  |   1.586774   2.108134     0.75   0.460    -2.810717    5.984264
       1977  |   4.471938   2.248611     1.99   0.061    -.2185829    9.162458
       1978  |   6.942881   2.462513     2.82   0.011     1.806169    12.07959
       1979  |   5.377887   2.246382     2.39   0.027     .6920164    10.06376
       1980  |    4.13152    2.51051     1.65   0.115    -1.105312    9.368352
       1981  |  -2.361104   3.525772    -0.67   0.511    -9.715736    4.993529
       1982  |  -1.001296   1.930725    -0.52   0.610    -5.028717    3.026125
       1983  |  -7.924902   2.937378    -2.70   0.014    -14.05216   -1.797639
       1984  |  -5.279501   3.675871    -1.44   0.166    -12.94723    2.388233
       1985  |  -7.184053   3.398726    -2.11   0.047    -14.27367   -.0944344
       1986  |  -3.536261   3.624687    -0.98   0.341    -11.09723    4.024705
       1987  |  -5.429719   3.878214    -1.40   0.177    -13.51953    2.660093
       1988  |  -4.480366   3.667831    -1.22   0.236    -12.13133    3.170595
       1989  |  -8.773123    4.11817    -2.13   0.046    -17.36347   -.1827716
       1990  |  -6.245387   3.153536    -1.98   0.062    -12.82355    .3327748
             |
       _cons |   56.98371   3.369066    16.91   0.000     49.95597    64.01146
------------------------------------------------------------------------------

. outreg2 using tableq3_q4.tex, append `opts' addtext(year FE,X, state FE, X, cluster,-) keep(mlda_21)
tableq3_q4.tex
dir : seeout

. 
. /* question 8 */
. /*
> Perform a "pre-program test" by coding up a placebo treatment indicator called "placebo82".
> hen estimate the model in Problem 5 using only the states that always have an MLDA of 21 
> or that switch in 1987, and using only the years of data prior to 1987.
> */
. 
. // generate placebo  treratent indicator 
. gen placebo82 = (mldayr == 1987 & year >= 1982) 

. 
. //  generate variable with states that have mlda = 21
. egen low_mlda = min(mlda), by(state)

.         
. // run regression with placebo on states if switch and if min is mlda 21
. reg rate18_20ht placebo82 i.state i.year        ///
>         if low_mlda == 21 | mldayr == 1987, robust cl(state)

Linear regression                               Number of obs     =        527
                                                F(15, 16)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.6967
                                                Root MSE          =     10.327

                                 (Std. err. adjusted for 17 clusters in state)
------------------------------------------------------------------------------
             |               Robust
 rate18_20ht | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   placebo82 |   12.48246   6.980467     1.79   0.093    -2.315469    27.28039
             |
       state |
          5  |  -17.63309   6.14e-14 -2.9e+14   0.000    -17.63309   -17.63309
          9  |  -48.01203   5.404233    -8.88   0.000    -59.46849   -36.55557
         12  |  -34.95501   5.404233    -6.47   0.000    -46.41147   -23.49855
         15  |  -14.43497   6.14e-14 -2.4e+14   0.000    -14.43497   -14.43497
         18  |  -4.167683   6.15e-14 -6.8e+13   0.000    -4.167683   -4.167683
         19  |  -17.52141   5.404233    -3.24   0.005    -28.97787   -6.064948
         25  |   -7.10363   5.404233    -1.31   0.207    -18.56009    4.352832
         26  |  -3.567835   6.14e-14 -5.8e+13   0.000    -3.567835   -3.567835
         29  |   2.198612   6.27e-14  3.5e+13   0.000     2.198612    2.198612
         32  |   16.47085   6.98e-14  2.4e+14   0.000     16.47085    16.47085
         35  |  -14.19745   6.14e-14 -2.3e+14   0.000    -14.19745   -14.19745
         38  |  -8.028192   6.14e-14 -1.3e+14   0.000    -8.028192   -8.028192
         39  |  -19.78079   6.15e-14 -3.2e+14   0.000    -19.78079   -19.78079
         45  |  -17.64001   6.14e-14 -2.9e+14   0.000    -17.64001   -17.64001
         46  |  -10.84704   5.404233    -2.01   0.062    -22.30351    .6094171
         48  |  -15.41629   6.14e-14 -2.5e+14   0.000    -15.41629   -15.41629
             |
        year |
       1976  |   .5042435   2.473026     0.20   0.841    -4.738338    5.746825
       1977  |   3.675133   2.456512     1.50   0.154     -1.53244    8.882707
       1978  |   6.772235    2.89294     2.34   0.033     .6394773    12.90499
       1979  |   6.258322   2.632965     2.38   0.030     .6766855    11.83996
       1980  |   3.968481   2.838854     1.40   0.181    -2.049621    9.986582
       1981  |   -3.53396   3.969825    -0.89   0.387    -11.94961    4.881694
       1982  |  -4.566972    2.99087    -1.53   0.146    -10.90733     1.77339
       1983  |  -11.95142   3.483563    -3.43   0.003    -19.33624   -4.566594
       1984  |  -9.200927   4.598849    -2.00   0.063    -18.95005    .5481978
       1985  |  -12.18483   3.772901    -3.23   0.005    -20.18303   -4.186642
       1986  |  -8.493662   4.454333    -1.91   0.075    -17.93643    .9491009
       1987  |  -9.936179   4.574557    -2.17   0.045    -19.63381   -.2385505
       1988  |    -7.8377   4.470168    -1.75   0.099    -17.31403    1.638633
       1989  |  -12.74238   4.708404    -2.71   0.016    -22.72375   -2.761006
       1990  |  -9.858259   3.802661    -2.59   0.020    -17.91954   -1.796978
       1991  |  -13.58316   4.412861    -3.08   0.007    -22.93801   -4.228315
       1992  |  -21.62062   5.042162    -4.29   0.001    -32.30952   -10.93171
       1993  |  -19.60673   5.522883    -3.55   0.003    -31.31472   -7.898742
       1994  |  -17.00584    5.49117    -3.10   0.007     -28.6466   -5.365081
       1995  |  -14.45753   4.564982    -3.17   0.006    -24.13486   -4.780205
       1996  |  -18.95722   5.155565    -3.68   0.002    -29.88653   -8.027914
       1997  |  -19.02078   5.191918    -3.66   0.002    -30.02716   -8.014408
       1998  |  -18.20703   5.305172    -3.43   0.003    -29.45349   -6.960569
       1999  |  -22.41392   5.453348    -4.11   0.001     -33.9745   -10.85333
       2000  |  -21.20539   5.542926    -3.83   0.001    -32.95587   -9.454913
       2001  |  -24.05151   6.753718    -3.56   0.003    -38.36876   -9.734269
       2002  |  -21.54605   5.561639    -3.87   0.001     -33.3362   -9.755902
       2003  |  -21.00465   5.418009    -3.88   0.001    -32.49032   -9.518985
       2004  |  -20.64556   5.744808    -3.59   0.002      -32.824   -8.467109
       2005  |  -22.56351   5.334571    -4.23   0.001     -33.8723   -11.25473
             |
       _cons |   65.24772   3.661408    17.82   0.000     57.48588    73.00956
------------------------------------------------------------------------------

. outreg2 using tableq3_q4.tex, append `opts' sortvar(mlda_21) addtext(year FE,X, state FE, X, cluster,X )  keep(placebo82)
tableq3_q4.tex
dir : seeout

. 
. 
. /* question 9 */
. /*
> Separately for MI and MD, estimate the treatment effect of switching to an MLDA of 21 using 
> data for that state and for the "always treated" states. Interpret the resulting estimates. 
> */
. // state = 21
. reg rate18_20ht mlda_21 i.state i.year ///
>     if state == 21 | low_mlda == 21, ///
>         robust cl(state)

Linear regression                               Number of obs     =        403
                                                F(11, 12)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.7189
                                                Root MSE          =     9.3487

                                 (Std. err. adjusted for 13 clusters in state)
------------------------------------------------------------------------------
             |               Robust
 rate18_20ht | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mlda_21 |   7.651658   3.915349     1.95   0.074    -.8791561    16.18247
             |
       state |
          5  |  -17.63309   1.42e-14 -1.2e+15   0.000    -17.63309   -17.63309
         15  |  -14.43497   1.56e-14 -9.3e+14   0.000    -14.43497   -14.43497
         18  |  -4.167683   1.11e-14 -3.8e+14   0.000    -4.167683   -4.167683
         21  |   -19.3106   1.010413   -19.11   0.000     -21.5121    -17.1091
         26  |  -3.567835   1.35e-14 -2.6e+14   0.000    -3.567835   -3.567835
         29  |   2.198612   1.94e-14  1.1e+14   0.000     2.198612    2.198612
         32  |   16.47085   2.28e-14  7.2e+14   0.000     16.47085    16.47085
         35  |  -14.19745   1.13e-14 -1.3e+15   0.000    -14.19745   -14.19745
         38  |  -8.028192   1.72e-14 -4.7e+14   0.000    -8.028192   -8.028192
         39  |  -19.78079   1.64e-14 -1.2e+15   0.000    -19.78079   -19.78079
         45  |  -17.64001   1.30e-14 -1.4e+15   0.000    -17.64001   -17.64001
         48  |  -15.41629   1.08e-14 -1.4e+15   0.000    -15.41629   -15.41629
             |
        year |
       1976  |   2.390141   2.065784     1.16   0.270    -2.110815    6.891096
       1977  |   5.662221   2.474736     2.29   0.041     .2702347    11.05421
       1978  |   8.198509   2.237057     3.66   0.003     3.324379    13.07264
       1979  |   5.209574   2.053598     2.54   0.026     .7351684    9.683979
       1980  |    5.21733    2.87236     1.82   0.094    -1.041005    11.47567
       1981  |  -4.148287   3.970967    -1.04   0.317    -12.80028    4.503707
       1982  |  -3.133128   1.924821    -1.63   0.130    -7.326953    1.060696
       1983  |  -11.29489   3.763394    -3.00   0.011    -19.49462   -3.095162
       1984  |  -10.77581   5.130771    -2.10   0.058     -21.9548    .4031748
       1985  |  -11.22028   3.570174    -3.14   0.008    -18.99902   -3.441537
       1986  |   -4.73139   4.126421    -1.15   0.274    -13.72209    4.259309
       1987  |  -6.702025   4.815573    -1.39   0.189    -17.19426    3.790209
       1988  |  -6.196403   4.665265    -1.33   0.209    -16.36114    3.968336
       1989  |  -11.28368   4.780289    -2.36   0.036    -21.69904   -.8683259
       1990  |  -7.643565   2.770352    -2.76   0.017    -13.67964   -1.607487
       1991  |  -11.71906   4.400461    -2.66   0.021    -21.30684   -2.131274
       1992  |   -22.5946   5.311574    -4.25   0.001    -34.16752   -11.02167
       1993  |  -19.37074   6.064803    -3.19   0.008    -32.58481   -6.156669
       1994  |  -18.36901   5.710607    -3.22   0.007    -30.81135   -5.926662
       1995  |  -15.22019   4.984877    -3.05   0.010     -26.0813   -4.359071
       1996  |  -17.47879    4.53413    -3.85   0.002    -27.35781    -7.59977
       1997  |  -18.37339   5.049941    -3.64   0.003    -29.37627   -7.370516
       1998  |  -20.37062   5.731796    -3.55   0.004    -32.85913   -7.882104
       1999  |  -22.63834   5.453008    -4.15   0.001    -34.51942   -10.75726
       2000  |  -20.34534   5.713698    -3.56   0.004    -32.79442   -7.896259
       2001  |  -22.67601      7.211    -3.14   0.008    -38.38743   -6.964595
       2002  |  -18.98767   5.012156    -3.79   0.003    -29.90822    -8.06712
       2003  |  -19.90012   4.866201    -4.09   0.002    -30.50266    -9.29758
       2004  |  -21.79337   5.842166    -3.73   0.003    -34.52235   -9.064383
       2005  |  -22.18755   5.022494    -4.42   0.001    -33.13063   -11.24448
             |
       _cons |   56.86894   1.306046    43.54   0.000     54.02331    59.71457
------------------------------------------------------------------------------

. outreg2 using tableq9-10.tex, replace `opts' sortvar(mlda_21) addtext(year FE,X, state FE, X, cluster,X) keep(mlda_21)
tableq9-10.tex
dir : seeout

. 
. // state = 23
. reg rate18_20ht mlda_21 i.state i.year ///
>     if state == 23 | low_mlda == 21, ///
>         robust cl(state)

Linear regression                               Number of obs     =        403
                                                F(11, 12)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.7165
                                                Root MSE          =     9.3313

                                 (Std. err. adjusted for 13 clusters in state)
------------------------------------------------------------------------------
             |               Robust
 rate18_20ht | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mlda_21 |  -1.006005   3.745579    -0.27   0.793     -9.16692     7.15491
             |
       state |
          5  |  -17.63309   6.02e-14 -2.9e+14   0.000    -17.63309   -17.63309
         15  |  -14.43497   5.99e-14 -2.4e+14   0.000    -14.43497   -14.43497
         18  |  -4.167683   6.01e-14 -6.9e+13   0.000    -4.167683   -4.167683
         23  |  -18.90751   .4833005   -39.12   0.000    -19.96053   -17.85449
         26  |  -3.567835   6.05e-14 -5.9e+13   0.000    -3.567835   -3.567835
         29  |   2.198612   6.06e-14  3.6e+13   0.000     2.198612    2.198612
         32  |   16.47085   7.85e-14  2.1e+14   0.000     16.47085    16.47085
         35  |  -14.19745   5.94e-14 -2.4e+14   0.000    -14.19745   -14.19745
         38  |  -8.028192   6.01e-14 -1.3e+14   0.000    -8.028192   -8.028192
         39  |  -19.78079   5.98e-14 -3.3e+14   0.000    -19.78079   -19.78079
         45  |  -17.64001   5.96e-14 -3.0e+14   0.000    -17.64001   -17.64001
         48  |  -15.41629   5.96e-14 -2.6e+14   0.000    -15.41629   -15.41629
             |
        year |
       1976  |   2.031494   2.028091     1.00   0.336    -2.387337    6.450325
       1977  |   6.179146   2.425904     2.55   0.026     .8935549    11.46474
       1978  |   7.255482   2.446089     2.97   0.012     1.925913    12.58505
       1979  |   4.785462   2.272617     2.11   0.057    -.1661456    9.737069
       1980  |   4.211526   3.170428     1.33   0.209    -2.696243     11.1193
       1981  |  -5.841014   4.206005    -1.39   0.190    -15.00511    3.323084
       1982  |  -4.206605   2.199267    -1.91   0.080    -8.998397    .5851867
       1983  |  -11.26196   3.755885    -3.00   0.011    -19.44533   -3.078592
       1984  |   -10.3078   5.092158    -2.02   0.066    -21.40266    .7870569
       1985  |  -11.78031    3.48542    -3.38   0.005    -19.37439   -4.186228
       1986  |  -4.658539   4.106761    -1.13   0.279     -13.6064    4.289325
       1987  |  -7.302451   4.781042    -1.53   0.153    -17.71945    3.114545
       1988  |  -6.359619   4.637228    -1.37   0.195    -16.46327    3.744033
       1989  |  -11.29659   4.761565    -2.37   0.035    -21.67115   -.9220354
       1990  |  -8.347942    2.80854    -2.97   0.012    -14.46723   -2.228659
       1991  |  -12.02875   4.391135    -2.74   0.018    -21.59621   -2.461285
       1992  |  -23.28178   5.303142    -4.39   0.001    -34.83633   -11.72722
       1993  |  -19.69281   6.043486    -3.26   0.007    -32.86044   -6.525188
       1994  |  -17.71542   5.710183    -3.10   0.009    -30.15684   -5.273995
       1995  |  -15.26065   4.969782    -3.07   0.010    -26.08887   -4.432422
       1996  |  -17.40881   4.507592    -3.86   0.002    -27.23001   -7.587607
       1997  |   -17.9841   5.058319    -3.56   0.004    -29.00524   -6.962975
       1998  |   -20.5469   5.733437    -3.58   0.004    -33.03899   -8.054813
       1999  |  -23.78082   5.340904    -4.45   0.001    -35.41765   -12.14399
       2000  |  -20.88136    5.65991    -3.69   0.003    -33.21324   -8.549476
       2001  |  -23.08371   7.180313    -3.21   0.007    -38.72827   -7.439155
       2002  |  -18.70232   4.984972    -3.75   0.003    -29.56365   -7.841003
       2003  |  -20.38625   4.884749    -4.17   0.001     -31.0292   -9.743294
       2004  |  -21.70361   5.808899    -3.74   0.003    -34.36012   -9.047108
       2005  |  -21.57339   5.023058    -4.29   0.001     -32.5177   -10.62909
             |
       _cons |   65.79931   1.082805    60.77   0.000     63.44008    68.15854
------------------------------------------------------------------------------

. outreg2 using tableq9-10.tex, append `opts' sortvar(mlda_21) addtext(year FE,X, state FE, X, cluster,X) keep(mlda_21)
tableq9-10.tex
dir : seeout

. 
. 
. /* question 10 */
. /*
> Repeat the exercise in the preceding problem but estimating treatment effects in relative 
> time by replacing the "mlda21" treatment indicator with indicators for the first four years
>  of treatment and remaining years of treatment. 
> */
. 
. // new treatment indicators
. bys state mlda (year): gen mlda_first = (year - year[1] <= 3 & mlda == 21 & low_mlda == 18)

. bys state mlda (year): gen mlda_remaining = (year - year[1] > 3 & mlda == 21 & low_mlda == 18)

. 
. // state = 21
. reg rate18_20ht mlda_first mlda_remaining i.state i.year        ///
>         if state == 21 | low_mlda == 21, ///
>         robust cl(state)

Linear regression                               Number of obs     =        403
                                                F(11, 12)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.7195
                                                Root MSE          =     9.3516

                                   (Std. err. adjusted for 13 clusters in state)
--------------------------------------------------------------------------------
               |               Robust
   rate18_20ht | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
    mlda_first |   3.757116   3.013881     1.25   0.236    -2.809567     10.3238
mlda_remaining |   8.471561    4.20247     2.02   0.067    -.6848353    17.62796
               |
         state |
            5  |  -17.63309   7.64e-15 -2.3e+15   0.000    -17.63309   -17.63309
           15  |  -14.43497   7.81e-15 -1.8e+15   0.000    -14.43497   -14.43497
           18  |  -4.167683   8.00e-15 -5.2e+14   0.000    -4.167683   -4.167683
           21  |  -26.96226   2.908991    -9.27   0.000     -33.3004   -20.62411
           26  |  -3.567835   9.38e-15 -3.8e+14   0.000    -3.567835   -3.567835
           29  |   2.198612   1.14e-14  1.9e+14   0.000     2.198612    2.198612
           32  |   16.47085   2.85e-14  5.8e+14   0.000     16.47085    16.47085
           35  |  -14.19745   7.64e-15 -1.9e+15   0.000    -14.19745   -14.19745
           38  |  -8.028192   9.76e-15 -8.2e+14   0.000    -8.028192   -8.028192
           39  |  -19.78079   8.18e-15 -2.4e+15   0.000    -19.78079   -19.78079
           45  |  -17.64001   8.78e-15 -2.0e+15   0.000    -17.64001   -17.64001
           48  |  -15.41629   8.04e-15 -1.9e+15   0.000    -15.41629   -15.41629
               |
          year |
         1976  |   2.390141   2.068667     1.16   0.270    -2.117097    6.897378
         1977  |   5.662221    2.47819     2.28   0.041     .2627093    11.06173
         1978  |   8.198509    2.24018     3.66   0.003     3.317577    13.07944
         1979  |   5.209574   2.056464     2.53   0.026     .7289236    9.690224
         1980  |    5.21733   2.876369     1.81   0.095     -1.04974     11.4844
         1981  |  -4.148287   3.976509    -1.04   0.317    -12.81236    4.515782
         1982  |  -3.133128   1.927507    -1.63   0.130    -7.332806     1.06655
         1983  |  -10.99531   3.747667    -2.93   0.013    -19.16078   -2.829848
         1984  |  -10.47623    5.06168    -2.07   0.061    -21.50469    .5522183
         1985  |   -10.9207   3.600631    -3.03   0.010     -18.7658   -3.075597
         1986  |   -4.43181   4.095339    -1.08   0.300    -13.35479    4.491167
         1987  |  -6.765094   4.824428    -1.40   0.186    -17.27662    3.746432
         1988  |  -6.259472   4.686478    -1.34   0.206    -16.47043    3.951487
         1989  |  -11.34675   4.793724    -2.37   0.036    -21.79138   -.9021219
         1990  |  -7.706635   2.782668    -2.77   0.017    -13.76955   -1.643721
         1991  |  -11.78212   4.423427    -2.66   0.021    -21.41994   -2.144305
         1992  |  -22.65766   5.334322    -4.25   0.001    -34.28015   -11.03518
         1993  |  -19.43381    6.08876    -3.19   0.008    -32.70008    -6.16754
         1994  |  -18.43208   5.742237    -3.21   0.007    -30.94333   -5.920816
         1995  |  -15.28326   5.003973    -3.05   0.010    -26.18598   -4.380535
         1996  |  -17.54186   4.553398    -3.85   0.002    -27.46286   -7.620858
         1997  |  -18.43646   5.082459    -3.63   0.003    -29.51019   -7.362735
         1998  |  -20.43369   5.763739    -3.55   0.004    -32.99179   -7.875576
         1999  |  -22.70141   5.471906    -4.15   0.001    -34.62367   -10.77915
         2000  |  -20.40841   5.735248    -3.56   0.004    -32.90444   -7.912376
         2001  |  -22.73908   7.234936    -3.14   0.008    -38.50265   -6.975512
         2002  |  -19.05074   5.049116    -3.77   0.003    -30.05182   -8.049661
         2003  |  -19.96319   4.889846    -4.08   0.002    -30.61725   -9.309131
         2004  |  -21.85644   5.870347    -3.72   0.003    -34.64683    -9.06605
         2005  |  -22.25062   5.057502    -4.40   0.001    -33.26997   -11.23127
               |
         _cons |    64.5206   3.586633    17.99   0.000       56.706     72.3352
--------------------------------------------------------------------------------

. outreg2 using tableq9-10.tex, append `opts' addtext(year FE,X, state FE, X, cluster,X) keep(mlda_first mlda_remaining)
tableq9-10.tex
dir : seeout

. 
. // state = 23
. reg rate18_20ht mlda_first mlda_remaining i.state i.year        ///
>         if state == 23 | low_mlda == 21, ///
>         robust cl(state)

Linear regression                               Number of obs     =        403
                                                F(11, 12)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.7197
                                                Root MSE          =     9.2905

                                   (Std. err. adjusted for 13 clusters in state)
--------------------------------------------------------------------------------
               |               Robust
   rate18_20ht | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
    mlda_first |  -10.10343    2.23235    -4.53   0.001    -14.96731   -5.239559
mlda_remaining |   .5761567   4.232976     0.14   0.894    -8.646705    9.799019
               |
         state |
            5  |  -17.63309   6.87e-14 -2.6e+14   0.000    -17.63309   -17.63309
           15  |  -14.43497   6.78e-14 -2.1e+14   0.000    -14.43497   -14.43497
           18  |  -4.167683   6.77e-14 -6.2e+13   0.000    -4.167683   -4.167683
           23  |  -17.90151   3.266831    -5.48   0.000    -25.01932   -10.78369
           26  |  -3.567835   6.76e-14 -5.3e+13   0.000    -3.567835   -3.567835
           29  |   2.198612   6.76e-14  3.3e+13   0.000     2.198612    2.198612
           32  |   16.47085   8.04e-14  2.0e+14   0.000     16.47085    16.47085
           35  |  -14.19745   6.78e-14 -2.1e+14   0.000    -14.19745   -14.19745
           38  |  -8.028192   6.76e-14 -1.2e+14   0.000    -8.028192   -8.028192
           39  |  -19.78079   6.93e-14 -2.9e+14   0.000    -19.78079   -19.78079
           45  |  -17.64001   6.79e-14 -2.6e+14   0.000    -17.64001   -17.64001
           48  |  -15.41629   6.76e-14 -2.3e+14   0.000    -15.41629   -15.41629
               |
          year |
         1976  |   2.031494   2.030922     1.00   0.337    -2.393504    6.456492
         1977  |   6.179146    2.42929     2.54   0.026     .8861779    11.47211
         1978  |   7.255482   2.449503     2.96   0.012     1.918475    12.59249
         1979  |   5.485264   2.101943     2.61   0.023     .9055226    10.06501
         1980  |   4.911328   3.026914     1.62   0.131    -1.683751    11.50641
         1981  |  -5.141212   4.008565    -1.28   0.224    -13.87513    3.592702
         1982  |  -3.506803   2.047429    -1.71   0.112    -7.967769    .9541625
         1983  |  -11.38367    3.80329    -2.99   0.011    -19.67032   -3.097011
         1984  |  -10.42951   5.136234    -2.03   0.065     -21.6204    .7613838
         1985  |  -11.90201   3.532362    -3.37   0.006    -19.59837   -4.205656
         1986  |  -4.780243   4.158271    -1.15   0.273    -13.84034    4.279852
         1987  |  -7.424156   4.831371    -1.54   0.150    -17.95081    3.102498
         1988  |  -6.481324   4.689777    -1.38   0.192    -16.69947    3.736823
         1989  |   -11.4183   4.802479    -2.38   0.035      -21.882    -.954595
         1990  |  -8.469647   2.868451    -2.95   0.012    -14.71946    -2.21983
         1991  |  -12.15045    4.45074    -2.73   0.018    -21.84778   -2.453122
         1992  |  -23.40348   5.354873    -4.37   0.001    -35.07075   -11.73621
         1993  |  -19.81452   6.095833    -3.25   0.007     -33.0962   -6.532837
         1994  |  -17.83712   5.745794    -3.10   0.009    -30.35613   -5.318112
         1995  |  -15.38235   5.013162    -3.07   0.010    -26.30509   -4.459611
         1996  |  -17.53051    4.54988    -3.85   0.002    -27.44385   -7.617175
         1997  |  -18.10581   5.093919    -3.55   0.004    -29.20451   -7.007113
         1998  |   -20.6686   5.787248    -3.57   0.004    -33.27793   -8.059274
         1999  |  -23.90252   5.388129    -4.44   0.001    -35.64224    -12.1628
         2000  |  -21.00306   5.705827    -3.68   0.003    -33.43499   -8.571135
         2001  |  -23.20542   7.224989    -3.21   0.007    -38.94732   -7.463518
         2002  |  -18.82403   5.035516    -3.74   0.003    -29.79548   -7.852581
         2003  |  -20.50795   4.928496    -4.16   0.001    -31.24622   -9.769681
         2004  |  -21.82532   5.861685    -3.72   0.003    -34.59683   -9.053801
         2005  |   -21.6951    5.05931    -4.29   0.001    -32.71839   -10.67181
               |
         _cons |    64.7933   3.623562    17.88   0.000     56.89824    72.68837
--------------------------------------------------------------------------------

. outreg2 using tableq9-10.tex, append `opts' addtext(year FE,X, state FE, X, cluster,X) keep(mlda_first mlda_remaining)
tableq9-10.tex
dir : seeout

. 
. 
. 
. // regression did
. log close
      name:  <unnamed>
       log:  /Users/gisellelab/pCloud Drive/PHD/Courses/02 - Second Year/ECON 717 (Metrics)/Problem Sets/Problem Set 3/log_ps3.log
  log type:  text
 closed on:  28 Mar 2022, 09:01:08
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
